### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [15]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [48]:
unique_items = purchase_data.groupby("Item Name")["Item Name"].count()
unique_items.count()

179

In [41]:
average_price = purchase_data["Price"].mean()
average_price

3.050987179487176

In [42]:
total_purchases = len(purchase_data)
total_purchases

780

In [43]:
revenue = purchase_data["Price"].sum()
revenue.round(2)

2379.77

In [83]:
purchasing_analysis = pd.DataFrame ({"Number of Unique Items":[unique_items.count()], "Average Price":[average_price], "Number of Purchases":[total_purchases], "Total Revenue":[revenue]})
purchasing_analysis

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [53]:
gender_count = purchase_data.groupby("Gender")["SN"].nunique()
gender_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [54]:
gender_percent = (gender_count/576) *100
gender_percent.round(2)

Gender
Female                   14.06
Male                     84.03
Other / Non-Disclosed     1.91
Name: SN, dtype: float64

In [73]:
demo_gender = pd.DataFrame({"Gender Count": gender_count, "Gender Percentage %": gender_percent.round(2)})
demo_gender

                       Gender Count  Gender Percentage %
Gender
Female                           81                14.06
Male                            484                84.03
Other / Non-Disclosed            11                 1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [58]:
gender_purchases = purchase_data.groupby("Gender")['Item Name']
gender_purchases.count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item Name, dtype: int64

In [61]:
gender_average = purchase_data.groupby("Gender")["Price"].mean()
gender_average.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [62]:
total_purchase = purchase_data.groupby("Gender")["Price"].sum()
total_purchase

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [66]:
total_average_purchase = total_purchase/gender_count
total_average_purchase.round(2)

Gender
Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [84]:
gender_analysis = pd.DataFrame({"Purchase Count": gender_purchases.count(), "Average Purchase Price $": gender_average.round(2), "Total Purchase Value": total_purchase, "Avg Total Purchase per Person": total_average_purchase.round(2)})
gender_analysis

,Purchase Count,Average Purchase Price $,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [85]:
bins = [0,10,15,20,25,30,35,40,45]
age_range = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", ">40"]

In [87]:
pd.cut(purchase_data["Age"], bins, labels= age_range)

0      15-19
1      35-39
2      20-24
3      20-24
4      20-24
5      20-24
6      35-39
7      15-19
8      20-24
9      30-34
10     20-24
11     20-24
12     20-24
13     20-24
14     30-34
15     20-24
16     15-19
17     20-24
18     20-24
19     25-29
20     15-19
21     15-19
22     35-39
23     35-39
24     25-29
25     25-29
26     10-14
27       <10
28     20-24
29     20-24
       ...
750    20-24
751    10-14
752    15-19
753    35-39
754    20-24
755    10-14
756    15-19
757    15-19
758    20-24
759    20-24
760    20-24
761      >40
762    25-29
763    20-24
764    15-19
765    15-19
766    20-24
767      <10
768    35-39
769    10-14
770    30-34
771    15-19
772    25-29
773    20-24
774    10-14
775    20-24
776    20-24
777    15-19
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < >40]

In [88]:
purchase_data["Age Range"] = pd.cut(purchase_data["Age"], bins, labels= age_range)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [92]:
age_range_num = purchase_data.groupby("Age Range")["Item Name"]
age_range_num.count()

Age Range
<10       32
10-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
>40        7
Name: Item Name, dtype: int64

In [123]:
age_range_percent = round(purchase_data["Age Range"].value_counts()/780, 2)*100
age_range_percent

20-24    42.0
15-19    26.0
25-29    10.0
10-14     7.0
30-34     7.0
35-39     4.0
<10       4.0
>40       1.0
Name: Age Range, dtype: float64

In [124]:
age_range_average = purchase_data.groupby("Age Range")["Price"].mean()
age_range_average.round(2)

Age Range
<10      3.40
10-14    2.90
15-19    3.11
20-24    3.02
25-29    2.88
30-34    2.99
35-39    3.40
>40      3.08
Name: Price, dtype: float64

In [125]:
percent_analysis = pd.DataFrame({"Total Count": age_range_num.count(), "Percentage of Players %": age_range_percent})
percent_analysis

       Total Count  Percentage of Players %
10-14           54                      7.0
15-19          200                     26.0
20-24          325                     42.0
25-29           77                     10.0
30-34           52                      7.0
35-39           33                      4.0
<10             32                      4.0
>40              7                      1.0

In [95]:
age_range_tot = purchase_data.groupby("Age Range")["Price"].sum()
age_range_tot

Age Range
<10      108.96
10-14    156.60
15-19    621.56
20-24    981.64
25-29    221.42
30-34    155.71
35-39    112.35
>40       21.53
Name: Price, dtype: float64

In [102]:
average_tot_purchase = age_range_tot/age_range_num.count()
average_tot_purchase.round(2)

Age Range
<10      3.40
10-14    2.90
15-19    3.11
20-24    3.02
25-29    2.88
30-34    2.99
35-39    3.40
>40      3.08
dtype: float64

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [113]:
purchasing_analysis = pd.DataFrame({"Purchase Count": age_range_num.count(), "Average Purchase Price $": age_range_average.round(2), "Total Purchase Value $": age_range_tot, "Avg Total Purchase per Person $": average_tot_purchase.round(2)})
purchasing_analysis

,Purchase Count,Average Purchase Price $,Total Purchase Value $,Avg Total Purchase per Person $
Age Range,,,,
<10,32,3.40,108.96,3.40
10-14,54,2.90,156.60,2.90
15-19,200,3.11,621.56,3.11
20-24,325,3.02,981.64,3.02
25-29,77,2.88,221.42,2.88
30-34,52,2.99,155.71,2.99
35-39,33,3.40,112.35,3.40
>40,7,3.08,21.53,3.08

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [161]:
players_num = purchase_data.groupby("SN").count()["Price"].rename("Purchase Count")
players_prices = purchase_data.groupby("SN").mean()["Price"].rename("Average Purchase Price")
players_tot = purchase_data.groupby("SN").sum()["Price"].rename("Total Purchase Value")
                                                
spenders_top = pd.DataFrame({"Average Purchase Price $": players_prices.round(2), "Purchase Count": players_num, "Total Purchase Price $": players_tot})  
spenders_top.head()

              Average Purchase Price $  Purchase Count  Total Purchase Price $
SN
Adairialis76                      2.28               1                    2.28
Adastirin33                       4.48               1                    4.48
Aeda94                            4.91               1                    4.91
Aela59                            4.32               1                    4.32
Aelaria33                         1.79               1                    1.79

In [159]:
spenders_topfive = spenders_top.sort_values("Total Purchase Price $", ascending=False)
spenders_topfive.head()

             Average Purchase Price $  Purchase Count  Total Purchase Price $
SN
Lisosia93                        3.79               5                   18.96
Idastidru52                      3.86               4                   15.45
Chamjask73                       4.61               3                   13.83
Iral74                           3.40               4                   13.62
Iskadarya95                      4.37               3                   13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [169]:
items_count = purchase_data.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
items_price = purchase_data.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Items Price $")
items_total = purchase_data.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value $")
                                                                                    
popular_items = pd.DataFrame({"Purchase Count": items_count, "Items Price $": items_price, "Total Purchase Value $": items_total})
popular_items.head()

,,Purchase Count,Items Price $,Total Purchase Value $
Item ID,Item Name,,,
0,Splinter,4,1.28,5.12
1,Crucifer,3,3.26,9.78
2,Verdict,6,2.48,14.88
3,Phantomlight,6,2.49,14.94
4,Bloodlord's Fetish,5,1.70,8.50

In [170]:
mostpopular_items = popular_items.sort_values("Purchase Count", ascending= False)
mostpopular_items.head()

,,Purchase Count,Items Price $,Total Purchase Value $
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [171]:
mostprofitable_items = popular_items.sort_values("Total Purchase Value $", ascending=False)
mostprofitable_items.head()

,,Purchase Count,Items Price $,Total Purchase Value $
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80